name: "llama_postprocess"
max_batch_size: 0
backend: "python"

input [
{
    name: "model_output"
    data_type: TYPE_STRING
    dims: [ -1 ]
}
]

output [
  {
    name: "postprocessed_output"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

instance_group [
    {
      count: 1
      kind: KIND_CPU
    }
]