name: "llama_bls_ensemble"
max_batch_size: 0
backend: "python"

input [
  {
    name: "text_input"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "temperature"
    data_type: TYPE_INT32
    dims: [1]
    optional: true
  },
  {
    name: "max_tokens"
    data_type: TYPE_INT32
    dims: [1]
    optional: true
  },
  {
    name: "stream"
    data_type: TYPE_BOOL
    dims: [1]
    optional: true
  }
]

output [
  {
    name: "text_output"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

instance_group [
    {
      count: 1
      kind: KIND_CPU
    }
]